Update submodule demos to indicate a dirty state
